In [149]:
import pandas as pd

In [150]:
data = pd.read_csv("bengaluru_house_prices.csv")

In [151]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [152]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [153]:
data.shape

(13320, 9)

In [154]:
data = data.price

In [155]:
data = pd.DataFrame(data)

In [156]:
data.head()

    price
0   39.07
1  120.00
2   62.00
3   95.00
4   51.00

In [157]:
data.shape

(13320, 1)

In [158]:
data.describe()

              price
count  13320.000000
mean     112.565627
std      148.971674
min        8.000000
25%       50.000000
50%       72.000000
75%      120.000000
max     3600.000000

In [159]:
std = data['price'].std()*3

In [160]:
mean = data['price'].mean()

In [161]:
data[(data['price'] > mean + std) | (data['price'] < mean - std)]

        price
7       600.0
62      650.0
159     760.0
408    2200.0
440     700.0
...       ...
13086   988.0
13095   660.0
13119   700.0
13197  2600.0
13200  2800.0

[192 rows x 1 columns]

In [162]:
new_data = data[(data < mean+std) & (data > mean-std)].dropna()

In [163]:
new_data

        price
0       39.07
1      120.00
2       62.00
3       95.00
4       51.00
...       ...
13315  231.00
13316  400.00
13317   60.00
13318  488.00
13319   17.00

[13128 rows x 1 columns]

In [164]:
data.shape[0]-new_data.shape[0]

192